FemDesign.ModellingTools.ConnectedLines.Points
This property is optional.
Represents first interface point, i.e Point@Parameter on Line between Edge[0].StartPoint and Edge[1].StartPoint.

FemDesign.ModellingTools.ConnectedLines.#ctor
Parameterless constructor for serialization

FemDesign.ModellingTools.ConnectedLines.#ctor(FemDesign.Geometry.Edge,FemDesign.Geometry.Edge,FemDesign.Geometry.Vector3d,FemDesign.Geometry.Vector3d,FemDesign.Releases.RigidityDataType3,FemDesign.GuidListType[],System.String,System.Boolean,System.Double,System.Double)
Constructor